'use strict'

// Задача 2. З клавіатури вводиться ціна товару і кількість грошей. 
// Якщо грошей не вистачає то відмовляємо у покупці, інакше, якщо ще залишаються гроші, то пропонуємо купити лотерею за 4 грн.

const priceProduct = parseFloat(prompt('введіть ціну товару', '37'))
const amountMoney = parseFloat(prompt('введіть кількість грошей', '27'))

document.write(`<h2>Задача 2. З клавіатури вводиться ціна товару і кількість грошей. 
Якщо грошей не вистачає то відмовляємо у покупці, інакше, якщо ще залишаються гроші, то пропонуємо купити лотерею за 4 грн.</h2>`)

if (priceProduct > amountMoney)
	document.write(`Ви не можете купити товар`)
else
	document.write(`Чи бажаєте ще купити лотерею за 4грн?`)

