'use strict'

// Задача 5. З клавіатури вводиться назва категорії водія (А-мотоцикл, В-легковий автомобіль, С-вантажний автомобіль). 
// Вивести на екран назву транспортного засобу, яким він може керувати.

const driverCategory = prompt('введіть категорію водійских прав', 'A').toUpperCase()
let vehicle



switch (driverCategory) {
	case 'A': vehicle = `мотоцикл`
		break
	case 'B': vehicle = `легковий автомобіль`
		break
	case 'C': vehicle = `вантажний автомобіль`
		break
	default:
		vehicle = `дані не визначено`
		break
}

document.write(`<h2>Задача 5. З клавіатури вводиться назва категорії водія (А-мотоцикл, В-легковий автомобіль, С-вантажний автомобіль). 
 Вивести на екран назву транспортного засобу, яким він може керувати..</h2>`)
document.write(`ви можете керувати: ${vehicle}`)