'use strict'


// Задача 3. Дано масив імен учнів. З’ясувати скільки разів зустрічається ім’я «Іван».

if (confirm('Почати тестування?')) {

	function getNames(arr) {
		let sum = 0
		for (let i = 0; i < arr.length; i++) {
			if (arr[i] == 'Іван') {
				sum += 1
			}
		}
		return sum
	}

	const arrName = ['Іван', 'Юля', 'Аня', 'Іван']
	document.write(`ім’я «Іван» зустрічається ${getNames(arrName)}`)


	// 	Задача 4. Дано послідовність номерів автомобілів. Підрахувати кількість номерів, які :
	// •	починаються на букву «А»;
	// •	перша і остання літери співпадають;
	// •	складаються з більше ніш 5 символів;





	// Задача 8. Дано одновимірний масив, у якому зберігається певна виграшна сума 
	// (елементи заповнюються випадковим чином значеннями від -500 до 500). 
	// Надаючи користувачу можливість вибирати номери елементів  (поки він не відмовиться). Знаходити сумарний виграш.


	// Задача 9. Морський бій. Користувач вводить кількість клітинок одновимірного масиву та кількість одиночних кораблів.
	//  Комп’ютер довільно розміщує ці одиночні кораблі у масиві по один у клітинці 
	//  (якщо у клітинці 0, то клітинка пуста, якщо 1 – то це означає, що там є корабель. 
	// 	Користувач вводить номер клітинки, куди стріляє. Гра продовжується до тих пір, поки не будуть потоплені усі кораблі.


}