"use strict";
if (confirm(`Почати   тестування?`)) {
    //   Задача 5.  З використанням замикань розробити ітератор, тобто функцію, 
    // що буде поступово за окремими викликами видавати по одне значення від заданого
    //  мінімального до заданого максимального. 
    // Якщо значення досягне максимального, то наступним буде мінімальне значення. 
    // З використанням цієї функції реалізувати перебір номерів місяців. 
    /**
     * ф-я замикання
     * @param min -мінімвльне число
     * @param max - максимальне число
     * @returns - поточне значення
     */
    function createNumber(min, max) {
        let counter = min - 1;
        function innerNumber() {
            if (counter < max)
                counter++;
            else
                counter = min;
            return counter;
        }
        return innerNumber;
    }
    const namesMonths = ["Січень", "Лютий", "Березень", "Квітень", "Травень", "Червень", "Липень", "Серпень", "Вересень", "Жовтень", "Листопад", "Грудень",];
    let monthsNum = createNumber(1, 12);
    for (let i = 0; i < 27; i++)
        document.write(`Місяць №: ${monthsNum()} - ${namesMonths[i % 12]}<br>`);
}
